references/bash-scripting-cheatsheet.org
#+TITLE: Bash scripting cheatsheet
#+AUTHOR: [[https://devhints.io/bash][devhints.io]]


* Getting started
:PROPERTIES:
:CUSTOM_ID: getting-started
:END:

** Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

This is a quick reference to getting started with Bash scripting.

- [[https://learnxinyminutes.com/docs/bash/][Learn bash in y minutes]]
  /(learnxinyminutes.com)/
- [[http://mywiki.wooledge.org/BashGuide][Bash Guide]]
  /(mywiki.wooledge.org)/
- [[https://web.archive.org/web/20230406205817/https://wiki.bash-hackers.org/][Bash Hackers Wiki]]
  /(wiki.bash-hackers.org)/

** Example
:PROPERTIES:
:CUSTOM_ID: example
:END:

#+begin_src language-bash
#!/usr/bin/env bash

name="John"
echo "Hello $name!"
#+end_src

** Variables
:PROPERTIES:
:CUSTOM_ID: variables
:END:

#+begin_src language-bash
name="John"
echo $name  # see below
echo "$name"
echo "${name}!"
#+end_src

Generally quote your variables unless they contain wildcards to expand
or command fragments.

#+begin_src language-bash
wildcard="*.txt"
options="iv"
cp -$options $wildcard /tmp
#+end_src

** String quotes
:PROPERTIES:
:CUSTOM_ID: string-quotes
:END:

#+begin_src language-bash
name="John"
echo "Hi $name"  #=> Hi John
echo 'Hi $name'  #=> Hi $name
#+end_src

** Shell execution
:PROPERTIES:
:CUSTOM_ID: shell-execution
:END:

#+begin_src language-bash
echo "I'm in $(pwd)"
echo "I'm in `pwd`"  # obsolescent
# Same
#+end_src

See
[[https://web.archive.org/web/20230326081741/https://wiki.bash-hackers.org/syntax/expansion/cmdsubst][Command substitution]]

** Conditional execution
:PROPERTIES:
:CUSTOM_ID: conditional-execution
:END:

#+begin_src language-bash
git commit && git push
git commit || echo "Commit failed"
#+end_src

** Functions
:PROPERTIES:
:CUSTOM_ID: functions-example
:END:

#+begin_src language-bash
get_name() {
  echo "John"
}

echo "You are $(get_name)"
#+end_src

See: [[#functions][Functions]]

** Conditionals
:PROPERTIES:
:CUSTOM_ID: conditionals-example
:END:

#+begin_src language-bash
if [[ -z "$string" ]]; then
  echo "String is empty"
elif [[ -n "$string" ]]; then
  echo "String is not empty"
fi
#+end_src

See: [[#conditionals][Conditionals]]

** Strict mode
:PROPERTIES:
:CUSTOM_ID: strict-mode
:END:

#+begin_src language-bash
set -euo pipefail
IFS=$'\n\t'
#+end_src

See:
[[http://redsymbol.net/articles/unofficial-bash-strict-mode/][Unofficial bash strict mode]]

** Brace expansion
:PROPERTIES:
:CUSTOM_ID: brace-expansion
:END:

#+begin_src language-bash
echo {A,B}.js
#+end_src

| Expression        | Description           |
|-------------------+-----------------------|
| ={A,B}=           | Same as =A B=         |
| ={A,B}.js=        | Same as =A.js B.js=   |
| ={1..5}=          | Same as =1 2 3 4 5=   |
| ={{1..3},{7..9}}= | Same as =1 2 3 7 8 9= |

See:
[[https://web.archive.org/web/20230207192110/https://wiki.bash-hackers.org/syntax/expansion/brace][Brace expansion]]

* Parameter expansions
:PROPERTIES:
:CUSTOM_ID: parameter-expansions
:END:

** Basics
:PROPERTIES:
:CUSTOM_ID: basics
:END:

#+begin_src language-bash
name="John"
echo "${name}"
echo "${name/J/j}"    #=> "john" (substitution)
echo "${name:0:2}"    #=> "Jo" (slicing)
echo "${name::2}"     #=> "Jo" (slicing)
echo "${name::-1}"    #=> "Joh" (slicing)
echo "${name:(-1)}"   #=> "n" (slicing from right)
echo "${name:(-2):1}" #=> "h" (slicing from right)
echo "${food:-Cake}"  #=> $food or "Cake"
#+end_src

#+begin_src language-bash
length=2
echo "${name:0:length}"  #=> "Jo"
#+end_src

See:
[[https://web.archive.org/web/20230408142504/https://wiki.bash-hackers.org/syntax/pe][Parameter expansion]]

#+begin_src language-bash
str="/path/to/foo.cpp"
echo "${str%.cpp}"    # /path/to/foo
echo "${str%.cpp}.o"  # /path/to/foo.o
echo "${str%/*}"      # /path/to

echo "${str##*.}"     # cpp (extension)
echo "${str##*/}"     # foo.cpp (basepath)

echo "${str#*/}"      # path/to/foo.cpp
echo "${str##*/}"     # foo.cpp

echo "${str/foo/bar}" # /path/to/bar.cpp
#+end_src

#+begin_src language-bash
str="Hello world"
echo "${str:6:5}"    # "world"
echo "${str: -5:5}"  # "world"
#+end_src

#+begin_src language-bash
src="/path/to/foo.cpp"
base=${src##*/}   #=> "foo.cpp" (basepath)
dir=${src%$base}  #=> "/path/to/" (dirpath)
dir=${src%/*}     #=> "/path/to" (dirpath)
#+end_src

** Prefix name expansion
:PROPERTIES:
:CUSTOM_ID: prefix-name-expansion
:END:

#+begin_src language-bash
prefix_a=one
prefix_b=two
echo ${!prefix_*}  # all variables names starting with `prefix_`
prefix_a prefix_b
#+end_src

** Indirection
:PROPERTIES:
:CUSTOM_ID: indirection
:END:

#+begin_src language-bash
name=joe
pointer=name
echo ${!pointer}
joe
#+end_src

** Substitution
:PROPERTIES:
:CUSTOM_ID: substitution
:END:

| Code              | Description         |
|-------------------+---------------------|
| =${foo%suffix}=   | Remove suffix       |
| =${foo#prefix}=   | Remove prefix       |
| =${foo%%suffix}=  | Remove long suffix  |
| =${foo/%suffix}=  | Remove long suffix  |
| =${foo##prefix}=  | Remove long prefix  |
| =${foo/#prefix}=  | Remove long prefix  |
| =${foo/from/to}=  | Replace first match |
| =${foo//from/to}= | Replace all         |
| =${foo/%from/to}= | Replace suffix      |
| =${foo/#from/to}= | Replace prefix      |

** Comments
:PROPERTIES:
:CUSTOM_ID: comments
:END:

#+begin_src language-bash
# Single line comment
#+end_src

#+begin_src language-bash
: '
This is a
multi line
comment
'
#+end_src

