docs/references/bash-scripting-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-06 Fri 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash scripting cheatsheet</title>
<meta name="author" content="[[https://devhints.io/bash][devhints.io]]" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../template/styles.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bash scripting cheatsheet</h1>
<div id="outline-container-getting-started" class="outline-2">
<h2 id="getting-started">Getting started</h2>
<div class="outline-text-2" id="text-getting-started">
</div>
<div id="outline-container-introduction" class="outline-3">
<h3 id="introduction">Introduction</h3>
<div class="outline-text-3" id="text-introduction">
<p>
This is a quick reference to getting started with Bash scripting.
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/bash/">Learn bash in y minutes</a>
<i>(learnxinyminutes.com)</i></li>
<li><a href="http://mywiki.wooledge.org/BashGuide">Bash Guide</a>
<i>(mywiki.wooledge.org)</i></li>
<li><a href="https://web.archive.org/web/20230406205817/https://wiki.bash-hackers.org/">Bash Hackers Wiki</a>
<i>(wiki.bash-hackers.org)</i></li>
</ul>
</div>
</div>
<div id="outline-container-example" class="outline-3">
<h3 id="example">Example</h3>
<div class="outline-text-3" id="text-example">
<div class="org-src-container">
<pre class="src src-language-bash">#!/usr/bin/env bash

name="John"
echo "Hello $name!"
</pre>
</div>
</div>
</div>
<div id="outline-container-variables" class="outline-3">
<h3 id="variables">Variables</h3>
<div class="outline-text-3" id="text-variables">
<div class="org-src-container">
<pre class="src src-language-bash">name="John"
echo $name  # see below
echo "$name"
echo "${name}!"
</pre>
</div>

<p>
Generally quote your variables unless they contain wildcards to expand
or command fragments.
</p>

<div class="org-src-container">
<pre class="src src-language-bash">wildcard="*.txt"
options="iv"
cp -$options $wildcard /tmp
</pre>
</div>
</div>
</div>
<div id="outline-container-string-quotes" class="outline-3">
<h3 id="string-quotes">String quotes</h3>
<div class="outline-text-3" id="text-string-quotes">
<div class="org-src-container">
<pre class="src src-language-bash">name="John"
echo "Hi $name"  #=&gt; Hi John
echo 'Hi $name'  #=&gt; Hi $name
</pre>
</div>
</div>
</div>
<div id="outline-container-shell-execution" class="outline-3">
<h3 id="shell-execution">Shell execution</h3>
<div class="outline-text-3" id="text-shell-execution">
<div class="org-src-container">
<pre class="src src-language-bash">echo "I'm in $(pwd)"
echo "I'm in `pwd`"  # obsolescent
# Same
</pre>
</div>

<p>
See
<a href="https://web.archive.org/web/20230326081741/https://wiki.bash-hackers.org/syntax/expansion/cmdsubst">Command substitution</a>
</p>
</div>
</div>
<div id="outline-container-conditional-execution" class="outline-3">
<h3 id="conditional-execution">Conditional execution</h3>
<div class="outline-text-3" id="text-conditional-execution">
<div class="org-src-container">
<pre class="src src-language-bash">git commit &amp;&amp; git push
git commit || echo "Commit failed"
</pre>
</div>
</div>
</div>
<div id="outline-container-functions-example" class="outline-3">
<h3 id="functions-example">Functions</h3>
<div class="outline-text-3" id="text-functions-example">
<div class="org-src-container">
<pre class="src src-language-bash">get_name() {
  echo "John"
}

echo "You are $(get_name)"
</pre>
</div>

<p>
See: <a href="#functions">Functions</a>
</p>
</div>
</div>
<div id="outline-container-conditionals-example" class="outline-3">
<h3 id="conditionals-example">Conditionals</h3>
<div class="outline-text-3" id="text-conditionals-example">
<div class="org-src-container">
<pre class="src src-language-bash">if [[ -z "$string" ]]; then
  echo "String is empty"
elif [[ -n "$string" ]]; then
  echo "String is not empty"
fi
</pre>
</div>

<p>
See: <a href="#conditionals">Conditionals</a>
</p>
</div>
</div>
<div id="outline-container-strict-mode" class="outline-3">
<h3 id="strict-mode">Strict mode</h3>
<div class="outline-text-3" id="text-strict-mode">
<div class="org-src-container">
<pre class="src src-language-bash">set -euo pipefail
IFS=$'\n\t'
</pre>
</div>

<p>
See:
<a href="http://redsymbol.net/articles/unofficial-bash-strict-mode/">Unofficial bash strict mode</a>
</p>
</div>
</div>
<div id="outline-container-brace-expansion" class="outline-3">
<h3 id="brace-expansion">Brace expansion</h3>
<div class="outline-text-3" id="text-brace-expansion">
<div class="org-src-container">
<pre class="src src-language-bash">echo {A,B}.js
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>{A,B}</code></td>
<td class="org-left">Same as <code>A B</code></td>
</tr>

<tr>
<td class="org-left"><code>{A,B}.js</code></td>
<td class="org-left">Same as <code>A.js B.js</code></td>
</tr>

<tr>
<td class="org-left"><code>{1..5}</code></td>
<td class="org-left">Same as <code>1 2 3 4 5</code></td>
</tr>

<tr>
<td class="org-left"><code>{{1..3},{7..9}}</code></td>
<td class="org-left">Same as <code>1 2 3 7 8 9</code></td>
</tr>
</tbody>
</table>

<p>
See:
<a href="https://web.archive.org/web/20230207192110/https://wiki.bash-hackers.org/syntax/expansion/brace">Brace expansion</a>
</p>
</div>
</div>
</div>
<div id="outline-container-parameter-expansions" class="outline-2">
<h2 id="parameter-expansions">Parameter expansions</h2>
<div class="outline-text-2" id="text-parameter-expansions">
</div>
<div id="outline-container-basics" class="outline-3">
<h3 id="basics">Basics</h3>
<div class="outline-text-3" id="text-basics">
<div class="org-src-container">
<pre class="src src-language-bash">name="John"
echo "${name}"
echo "${name/J/j}"    #=&gt; "john" (substitution)
echo "${name:0:2}"    #=&gt; "Jo" (slicing)
echo "${name::2}"     #=&gt; "Jo" (slicing)
echo "${name::-1}"    #=&gt; "Joh" (slicing)
echo "${name:(-1)}"   #=&gt; "n" (slicing from right)
echo "${name:(-2):1}" #=&gt; "h" (slicing from right)
echo "${food:-Cake}"  #=&gt; $food or "Cake"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">length=2
echo "${name:0:length}"  #=&gt; "Jo"
</pre>
</div>

<p>
See:
<a href="https://web.archive.org/web/20230408142504/https://wiki.bash-hackers.org/syntax/pe">Parameter expansion</a>
</p>

<div class="org-src-container">
<pre class="src src-language-bash">str="/path/to/foo.cpp"
echo "${str%.cpp}"    # /path/to/foo
echo "${str%.cpp}.o"  # /path/to/foo.o
echo "${str%/*}"      # /path/to

echo "${str##*.}"     # cpp (extension)
echo "${str##*/}"     # foo.cpp (basepath)

echo "${str#*/}"      # path/to/foo.cpp
echo "${str##*/}"     # foo.cpp

echo "${str/foo/bar}" # /path/to/bar.cpp
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">str="Hello world"
echo "${str:6:5}"    # "world"
echo "${str: -5:5}"  # "world"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">src="/path/to/foo.cpp"
base=${src##*/}   #=&gt; "foo.cpp" (basepath)
dir=${src%$base}  #=&gt; "/path/to/" (dirpath)
dir=${src%/*}     #=&gt; "/path/to" (dirpath)
</pre>
</div>
</div>
</div>
<div id="outline-container-prefix-name-expansion" class="outline-3">
<h3 id="prefix-name-expansion">Prefix name expansion</h3>
<div class="outline-text-3" id="text-prefix-name-expansion">
<div class="org-src-container">
<pre class="src src-language-bash">prefix_a=one
prefix_b=two
echo ${!prefix_*}  # all variables names starting with `prefix_`
prefix_a prefix_b
</pre>
</div>
</div>
</div>
<div id="outline-container-indirection" class="outline-3">
<h3 id="indirection">Indirection</h3>
<div class="outline-text-3" id="text-indirection">
<div class="org-src-container">
<pre class="src src-language-bash">name=joe
pointer=name
echo ${!pointer}
joe
</pre>
</div>
</div>
</div>
<div id="outline-container-substitution" class="outline-3">
<h3 id="substitution">Substitution</h3>
<div class="outline-text-3" id="text-substitution">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>${foo%suffix}</code></td>
<td class="org-left">Remove suffix</td>
</tr>

<tr>
<td class="org-left"><code>${foo#prefix}</code></td>
<td class="org-left">Remove prefix</td>
</tr>

<tr>
<td class="org-left"><code>${foo%%suffix}</code></td>
<td class="org-left">Remove long suffix</td>
</tr>

<tr>
<td class="org-left"><code>${foo/%suffix}</code></td>
<td class="org-left">Remove long suffix</td>
</tr>

<tr>
<td class="org-left"><code>${foo##prefix}</code></td>
<td class="org-left">Remove long prefix</td>
</tr>

<tr>
<td class="org-left"><code>${foo/#prefix}</code></td>
<td class="org-left">Remove long prefix</td>
</tr>

<tr>
<td class="org-left"><code>${foo/from/to}</code></td>
<td class="org-left">Replace first match</td>
</tr>

<tr>
<td class="org-left"><code>${foo//from/to}</code></td>
<td class="org-left">Replace all</td>
</tr>

<tr>
<td class="org-left"><code>${foo/%from/to}</code></td>
<td class="org-left">Replace suffix</td>
</tr>

<tr>
<td class="org-left"><code>${foo/#from/to}</code></td>
<td class="org-left">Replace prefix</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-comments" class="outline-3">
<h3 id="comments">Comments</h3>
<div class="outline-text-3" id="text-comments">
<div class="org-src-container">
<pre class="src src-language-bash"># Single line comment
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">: '
This is a
multi line
comment
'
</pre>
</div>
</div>
</div>
