references/bash-scripting-cheatsheet.org
** Substrings
:PROPERTIES:
:CUSTOM_ID: substrings
:END:

| Expression      | Description                    |
|-----------------+--------------------------------|
| =${foo:0:3}=    | Substring /(position, length)/ |
| =${foo:(-3):3}= | Substring from the right       |

** Length
:PROPERTIES:
:CUSTOM_ID: length
:END:

| Expression | Description      |
|------------+------------------|
| =${#foo}=  | Length of =$foo= |

** Manipulation
:PROPERTIES:
:CUSTOM_ID: manipulation
:END:

#+begin_src language-bash
str="HELLO WORLD!"
echo "${str,}"   #=> "hELLO WORLD!" (lowercase 1st letter)
echo "${str,,}"  #=> "hello world!" (all lowercase)

str="hello world!"
echo "${str^}"   #=> "Hello world!" (uppercase 1st letter)
echo "${str^^}"  #=> "HELLO WORLD!" (all uppercase)
#+end_src

** Default values
:PROPERTIES:
:CUSTOM_ID: default-values
:END:

| Expression        | Description                                              |
|-------------------+----------------------------------------------------------|
| =${foo:-val}=     | =$foo=, or =val= if unset (or null)                      |
| =${foo:=val}=     | Set =$foo= to =val= if unset (or null)                   |
| =${foo:+val}=     | =val= if =$foo= is set (and not null)                    |
| =${foo:?message}= | Show error message and exit if =$foo= is unset (or null) |

Omitting the =:= removes the (non)nullity checks, e.g. =${foo-val}=
expands to =val= if unset otherwise =$foo=.

* Loops
:PROPERTIES:
:CUSTOM_ID: loops
:END:

** Basic for loop
:PROPERTIES:
:CUSTOM_ID: basic-for-loop
:END:

#+begin_src language-bash
for i in /etc/rc.*; do
  echo "$i"
done
#+end_src

** C-like for loop
:PROPERTIES:
:CUSTOM_ID: c-like-for-loop
:END:

#+begin_src language-bash
for ((i = 0 ; i < 100 ; i++)); do
  echo "$i"
done
#+end_src

** Ranges
:PROPERTIES:
:CUSTOM_ID: ranges
:END:

#+begin_src language-bash
for i in {1..5}; do
    echo "Welcome $i"
done
#+end_src

*** With step size
:PROPERTIES:
:CUSTOM_ID: with-step-size
:END:
#+begin_src language-bash
for i in {5..50..5}; do
    echo "Welcome $i"
done
#+end_src

** Reading lines
:PROPERTIES:
:CUSTOM_ID: reading-lines
:END:

#+begin_src language-bash
while read -r line; do
  echo "$line"
done <file.txt
#+end_src

** Forever
:PROPERTIES:
:CUSTOM_ID: forever
:END:

#+begin_src language-bash
while true; do
  ···
done
#+end_src

* Functions
:PROPERTIES:
:CUSTOM_ID: functions
:END:

** Defining functions
:PROPERTIES:
:CUSTOM_ID: defining-functions
:END:

#+begin_src language-bash
myfunc() {
    echo "hello $1"
}
#+end_src

#+begin_src language-bash
# Same as above (alternate syntax)
function myfunc {
    echo "hello $1"
}
#+end_src

#+begin_src language-bash
myfunc "John"
#+end_src

** Returning values
:PROPERTIES:
:CUSTOM_ID: returning-values
:END:

#+begin_src language-bash
myfunc() {
    local myresult='some value'
    echo "$myresult"
}
#+end_src

#+begin_src language-bash
result=$(myfunc)
#+end_src

** Raising errors
:PROPERTIES:
:CUSTOM_ID: raising-errors
:END:

#+begin_src language-bash
myfunc() {
  return 1
}
#+end_src

#+begin_src language-bash
if myfunc; then
  echo "success"
else
  echo "failure"
fi
#+end_src

** Arguments
:PROPERTIES:
:CUSTOM_ID: arguments
:END:

| Expression | Description                                    |
|------------+------------------------------------------------|
| =$#=       | Number of arguments                            |
| =$*=       | All positional arguments (as a single word)    |
| =$@=       | All positional arguments (as separate strings) |
| =$1=       | First argument                                 |
| =$_=       | Last argument of the previous command          |

*Note*: =$@= and =$*= must be quoted in order to perform as described.
Otherwise, they do exactly the same thing (arguments as separate
strings).

See
[[https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars#special_parameters_and_shell_variables][Special parameters]].

* Conditionals
:PROPERTIES:
:CUSTOM_ID: conditionals
:END:

** Conditions
:PROPERTIES:
:CUSTOM_ID: conditions
:END:

Note that =[[= is actually a command/program that returns either =0=
(true) or =1= (false). Any program that obeys the same logic (like all
base utils, such as =grep(1)= or =ping(1)=) can be used as condition,
see examples.

| Condition                | Description           |
|--------------------------+-----------------------|
| =[[ -z STRING ]]=        | Empty string          |
| =[[ -n STRING ]]=        | Not empty string      |
| =[[ STRING == STRING ]]= | Equal                 |
| =[[ STRING != STRING ]]= | Not Equal             |
| =[[ NUM -eq NUM ]]=      | Equal                 |
| =[[ NUM -ne NUM ]]=      | Not equal             |
| =[[ NUM -lt NUM ]]=      | Less than             |
| =[[ NUM -le NUM ]]=      | Less than or equal    |
| =[[ NUM -gt NUM ]]=      | Greater than          |
| =[[ NUM -ge NUM ]]=      | Greater than or equal |
| =[[ STRING =~ STRING ]]= | Regexp                |
| =(( NUM < NUM ))=        | Numeric conditions    |

