docs/references/bash-scripting-cheatsheet.html
<div id="outline-container-substrings" class="outline-3">
<h3 id="substrings">Substrings</h3>
<div class="outline-text-3" id="text-substrings">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>${foo:0:3}</code></td>
<td class="org-left">Substring <i>(position, length)</i></td>
</tr>

<tr>
<td class="org-left"><code>${foo:(-3):3}</code></td>
<td class="org-left">Substring from the right</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-length" class="outline-3">
<h3 id="length">Length</h3>
<div class="outline-text-3" id="text-length">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>${#foo}</code></td>
<td class="org-left">Length of <code>$foo</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-manipulation" class="outline-3">
<h3 id="manipulation">Manipulation</h3>
<div class="outline-text-3" id="text-manipulation">
<div class="org-src-container">
<pre class="src src-language-bash">str="HELLO WORLD!"
echo "${str,}"   #=&gt; "hELLO WORLD!" (lowercase 1st letter)
echo "${str,,}"  #=&gt; "hello world!" (all lowercase)

str="hello world!"
echo "${str^}"   #=&gt; "Hello world!" (uppercase 1st letter)
echo "${str^^}"  #=&gt; "HELLO WORLD!" (all uppercase)
</pre>
</div>
</div>
</div>
<div id="outline-container-default-values" class="outline-3">
<h3 id="default-values">Default values</h3>
<div class="outline-text-3" id="text-default-values">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>${foo:-val}</code></td>
<td class="org-left"><code>$foo</code>, or <code>val</code> if unset (or null)</td>
</tr>

<tr>
<td class="org-left"><code>${foo:=val}</code></td>
<td class="org-left">Set <code>$foo</code> to <code>val</code> if unset (or null)</td>
</tr>

<tr>
<td class="org-left"><code>${foo:+val}</code></td>
<td class="org-left"><code>val</code> if <code>$foo</code> is set (and not null)</td>
</tr>

<tr>
<td class="org-left"><code>${foo:?message}</code></td>
<td class="org-left">Show error message and exit if <code>$foo</code> is unset (or null)</td>
</tr>
</tbody>
</table>

<p>
Omitting the <code>:</code> removes the (non)nullity checks, e.g. <code>${foo-val}</code>
expands to <code>val</code> if unset otherwise <code>$foo</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-loops" class="outline-2">
<h2 id="loops">Loops</h2>
<div class="outline-text-2" id="text-loops">
</div>
<div id="outline-container-basic-for-loop" class="outline-3">
<h3 id="basic-for-loop">Basic for loop</h3>
<div class="outline-text-3" id="text-basic-for-loop">
<div class="org-src-container">
<pre class="src src-language-bash">for i in /etc/rc.*; do
  echo "$i"
done
</pre>
</div>
</div>
</div>
<div id="outline-container-c-like-for-loop" class="outline-3">
<h3 id="c-like-for-loop">C-like for loop</h3>
<div class="outline-text-3" id="text-c-like-for-loop">
<div class="org-src-container">
<pre class="src src-language-bash">for ((i = 0 ; i &lt; 100 ; i++)); do
  echo "$i"
done
</pre>
</div>
</div>
</div>
<div id="outline-container-ranges" class="outline-3">
<h3 id="ranges">Ranges</h3>
<div class="outline-text-3" id="text-ranges">
<div class="org-src-container">
<pre class="src src-language-bash">for i in {1..5}; do
    echo "Welcome $i"
done
</pre>
</div>
</div>
<div id="outline-container-with-step-size" class="outline-4">
<h4 id="with-step-size">With step size</h4>
<div class="outline-text-4" id="text-with-step-size">
<div class="org-src-container">
<pre class="src src-language-bash">for i in {5..50..5}; do
    echo "Welcome $i"
done
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-reading-lines" class="outline-3">
<h3 id="reading-lines">Reading lines</h3>
<div class="outline-text-3" id="text-reading-lines">
<div class="org-src-container">
<pre class="src src-language-bash">while read -r line; do
  echo "$line"
done &lt;file.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-forever" class="outline-3">
<h3 id="forever">Forever</h3>
<div class="outline-text-3" id="text-forever">
<div class="org-src-container">
<pre class="src src-language-bash">while true; do
  ···
done
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-functions" class="outline-2">
<h2 id="functions">Functions</h2>
<div class="outline-text-2" id="text-functions">
</div>
<div id="outline-container-defining-functions" class="outline-3">
<h3 id="defining-functions">Defining functions</h3>
<div class="outline-text-3" id="text-defining-functions">
<div class="org-src-container">
<pre class="src src-language-bash">myfunc() {
    echo "hello $1"
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash"># Same as above (alternate syntax)
function myfunc {
    echo "hello $1"
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">myfunc "John"
</pre>
</div>
</div>
</div>
<div id="outline-container-returning-values" class="outline-3">
<h3 id="returning-values">Returning values</h3>
<div class="outline-text-3" id="text-returning-values">
<div class="org-src-container">
<pre class="src src-language-bash">myfunc() {
    local myresult='some value'
    echo "$myresult"
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">result=$(myfunc)
</pre>
</div>
</div>
</div>
<div id="outline-container-raising-errors" class="outline-3">
<h3 id="raising-errors">Raising errors</h3>
<div class="outline-text-3" id="text-raising-errors">
<div class="org-src-container">
<pre class="src src-language-bash">myfunc() {
  return 1
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">if myfunc; then
  echo "success"
else
  echo "failure"
fi
</pre>
</div>
</div>
</div>
<div id="outline-container-arguments" class="outline-3">
<h3 id="arguments">Arguments</h3>
<div class="outline-text-3" id="text-arguments">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>$#</code></td>
<td class="org-left">Number of arguments</td>
</tr>

<tr>
<td class="org-left"><code>$*</code></td>
<td class="org-left">All positional arguments (as a single word)</td>
</tr>

<tr>
<td class="org-left"><code>$@</code></td>
<td class="org-left">All positional arguments (as separate strings)</td>
</tr>

<tr>
<td class="org-left"><code>$1</code></td>
<td class="org-left">First argument</td>
</tr>

<tr>
<td class="org-left"><code>$_</code></td>
<td class="org-left">Last argument of the previous command</td>
</tr>
</tbody>
</table>

<p>
<b>Note</b>: <code>$@</code> and <code>$*</code> must be quoted in order to perform as described.
Otherwise, they do exactly the same thing (arguments as separate
strings).
</p>

<p>
See
<a href="https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars#special_parameters_and_shell_variables">Special parameters</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-conditionals" class="outline-2">
<h2 id="conditionals">Conditionals</h2>
<div class="outline-text-2" id="text-conditionals">
</div>
<div id="outline-container-conditions" class="outline-3">
<h3 id="conditions">Conditions</h3>
<div class="outline-text-3" id="text-conditions">
<p>
Note that <code>[[</code> is actually a command/program that returns either <code>0</code>
(true) or <code>1</code> (false). Any program that obeys the same logic (like all
base utils, such as <code>grep(1)</code> or <code>ping(1)</code>) can be used as condition,
see examples.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Condition</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[[ -z STRING ]]</code></td>
<td class="org-left">Empty string</td>
</tr>

<tr>
<td class="org-left"><code>[[ -n STRING ]]</code></td>
<td class="org-left">Not empty string</td>
</tr>

<tr>
<td class="org-left"><code>[[ STRING =</code> STRING ]]=</td>
<td class="org-left">Equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ STRING !</code> STRING ]]=</td>
<td class="org-left">Not Equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -eq NUM ]]</code></td>
<td class="org-left">Equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -ne NUM ]]</code></td>
<td class="org-left">Not equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -lt NUM ]]</code></td>
<td class="org-left">Less than</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -le NUM ]]</code></td>
<td class="org-left">Less than or equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -gt NUM ]]</code></td>
<td class="org-left">Greater than</td>
</tr>

<tr>
<td class="org-left"><code>[[ NUM -ge NUM ]]</code></td>
<td class="org-left">Greater than or equal</td>
</tr>

<tr>
<td class="org-left"><code>[[ STRING =~ STRING ]]</code></td>
<td class="org-left">Regexp</td>
</tr>

<tr>
<td class="org-left"><code>(( NUM &lt; NUM ))</code></td>
<td class="org-left">Numeric conditions</td>
</tr>
</tbody>
</table>
</div>
