references/bash-scripting-cheatsheet.org
*** More conditions
:PROPERTIES:
:CUSTOM_ID: more-conditions
:END:
| Condition            | Description              |
|----------------------+--------------------------|
| =[[ -o noclobber ]]= | If OPTIONNAME is enabled |
| =[[ ! EXPR ]]=       | Not                      |
| =[[ X && Y ]]=       | And                      |
| =[[ X || Y ]]=       | Or                       |

** File conditions
:PROPERTIES:
:CUSTOM_ID: file-conditions
:END:

| Condition               | Description             |
|-------------------------+-------------------------|
| =[[ -e FILE ]]=         | Exists                  |
| =[[ -r FILE ]]=         | Readable                |
| =[[ -h FILE ]]=         | Symlink                 |
| =[[ -d FILE ]]=         | Directory               |
| =[[ -w FILE ]]=         | Writable                |
| =[[ -s FILE ]]=         | Size is > 0 bytes       |
| =[[ -f FILE ]]=         | File                    |
| =[[ -x FILE ]]=         | Executable              |
| =[[ FILE1 -nt FILE2 ]]= | 1 is more recent than 2 |
| =[[ FILE1 -ot FILE2 ]]= | 2 is more recent than 1 |
| =[[ FILE1 -ef FILE2 ]]= | Same files              |

** Example
:PROPERTIES:
:CUSTOM_ID: example-1
:END:

#+begin_src language-bash
# String
if [[ -z "$string" ]]; then
  echo "String is empty"
elif [[ -n "$string" ]]; then
  echo "String is not empty"
else
  echo "This never happens"
fi
#+end_src

#+begin_src language-bash
# Combinations
if [[ X && Y ]]; then
  ...
fi
#+end_src

#+begin_src language-bash
# Equal
if [[ "$A" == "$B" ]]
#+end_src

#+begin_src language-bash
# Regex
if [[ "A" =~ . ]]
#+end_src

#+begin_src language-bash
if (( $a < $b )); then
   echo "$a is smaller than $b"
fi
#+end_src

#+begin_src language-bash
if [[ -e "file.txt" ]]; then
  echo "file exists"
fi
#+end_src

* Arrays
:PROPERTIES:
:CUSTOM_ID: arrays
:END:

** Defining arrays
:PROPERTIES:
:CUSTOM_ID: defining-arrays
:END:

#+begin_src language-bash
Fruits=('Apple' 'Banana' 'Orange')
#+end_src

#+begin_src language-bash
Fruits[0]="Apple"
Fruits[1]="Banana"
Fruits[2]="Orange"
#+end_src

** Working with arrays
:PROPERTIES:
:CUSTOM_ID: working-with-arrays
:END:

#+begin_src language-bash
echo "${Fruits[0]}"           # Element #0
echo "${Fruits[-1]}"          # Last element
echo "${Fruits[@]}"           # All elements, space-separated
echo "${#Fruits[@]}"          # Number of elements
echo "${#Fruits}"             # String length of the 1st element
echo "${#Fruits[3]}"          # String length of the Nth element
echo "${Fruits[@]:3:2}"       # Range (from position 3, length 2)
echo "${!Fruits[@]}"          # Keys of all elements, space-separated
#+end_src

** Operations
:PROPERTIES:
:CUSTOM_ID: operations
:END:

#+begin_src language-bash
Fruits=("${Fruits[@]}" "Watermelon")    # Push
Fruits+=('Watermelon')                  # Also Push
Fruits=( "${Fruits[@]/Ap*/}" )          # Remove by regex match
unset Fruits[2]                         # Remove one item
Fruits=("${Fruits[@]}")                 # Duplicate
Fruits=("${Fruits[@]}" "${Veggies[@]}") # Concatenate
words=($(< datafile))                   # From file (split by IFS)
#+end_src

** Iteration
:PROPERTIES:
:CUSTOM_ID: iteration
:END:

#+begin_src language-bash
for i in "${arrayName[@]}"; do
  echo "$i"
done
#+end_src

* Dictionaries
:PROPERTIES:
:CUSTOM_ID: dictionaries
:END:

** Defining
:PROPERTIES:
:CUSTOM_ID: defining
:END:

#+begin_src language-bash
declare -A sounds
#+end_src

#+begin_src language-bash
sounds[dog]="bark"
sounds[cow]="moo"
sounds[bird]="tweet"
sounds[wolf]="howl"
#+end_src

Declares =sound= as a Dictionary object (aka associative array).

** Working with dictionaries
:PROPERTIES:
:CUSTOM_ID: working-with-dictionaries
:END:

#+begin_src language-bash
echo "${sounds[dog]}" # Dog's sound
echo "${sounds[@]}"   # All values
echo "${!sounds[@]}"  # All keys
echo "${#sounds[@]}"  # Number of elements
unset sounds[dog]     # Delete dog
#+end_src

** Iteration
:PROPERTIES:
:CUSTOM_ID: iteration-1
:END:

*** Iterate over values
:PROPERTIES:
:CUSTOM_ID: iterate-over-values
:END:
#+begin_src language-bash
for val in "${sounds[@]}"; do
  echo "$val"
done
#+end_src

*** Iterate over keys
:PROPERTIES:
:CUSTOM_ID: iterate-over-keys
:END:
#+begin_src language-bash
for key in "${!sounds[@]}"; do
  echo "$key"
done
#+end_src

* Options
:PROPERTIES:
:CUSTOM_ID: options
:END:

** Options
:PROPERTIES:
:CUSTOM_ID: options-1
:END:

#+begin_src language-bash
set -o noclobber  # Avoid overlay files (echo "hi" > foo)
set -o errexit    # Used to exit upon error, avoiding cascading errors
set -o pipefail   # Unveils hidden failures
set -o nounset    # Exposes unset variables
#+end_src

** Glob options
:PROPERTIES:
:CUSTOM_ID: glob-options
:END:

#+begin_src language-bash
shopt -s nullglob    # Non-matching globs are removed  ('*.foo' => '')
shopt -s failglob    # Non-matching globs throw errors
shopt -s nocaseglob  # Case insensitive globs
shopt -s dotglob     # Wildcards match dotfiles ("*.sh" => ".foo.sh")
shopt -s globstar    # Allow ** for recursive matches ('lib/**/*.rb' => 'lib/a/b/c.rb')
#+end_src

Set =GLOBIGNORE= as a colon-separated list of patterns to be removed
from glob matches.

* History
:PROPERTIES:
:CUSTOM_ID: history
:END:

** Commands
:PROPERTIES:
:CUSTOM_ID: commands
:END:

| Command               | Description                               |
|-----------------------+-------------------------------------------|
| =history=             | Show history                              |
| =shopt -s histverify= | Don't execute expanded result immediately |

