docs/references/bash-scripting-cheatsheet.html
<div id="outline-container-more-conditions" class="outline-4">
<h4 id="more-conditions">More conditions</h4>
<div class="outline-text-4" id="text-more-conditions">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Condition</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[[ -o noclobber ]]</code></td>
<td class="org-left">If OPTIONNAME is enabled</td>
</tr>

<tr>
<td class="org-left"><code>[[ ! EXPR ]]</code></td>
<td class="org-left">Not</td>
</tr>

<tr>
<td class="org-left"><code>[[ X &amp;&amp; Y ]]</code></td>
<td class="org-left">And</td>
</tr>

<tr>
<td class="org-left">=[[ X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y ]]=</td>
<td class="org-left">Or</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-file-conditions" class="outline-3">
<h3 id="file-conditions">File conditions</h3>
<div class="outline-text-3" id="text-file-conditions">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Condition</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[[ -e FILE ]]</code></td>
<td class="org-left">Exists</td>
</tr>

<tr>
<td class="org-left"><code>[[ -r FILE ]]</code></td>
<td class="org-left">Readable</td>
</tr>

<tr>
<td class="org-left"><code>[[ -h FILE ]]</code></td>
<td class="org-left">Symlink</td>
</tr>

<tr>
<td class="org-left"><code>[[ -d FILE ]]</code></td>
<td class="org-left">Directory</td>
</tr>

<tr>
<td class="org-left"><code>[[ -w FILE ]]</code></td>
<td class="org-left">Writable</td>
</tr>

<tr>
<td class="org-left"><code>[[ -s FILE ]]</code></td>
<td class="org-left">Size is &gt; 0 bytes</td>
</tr>

<tr>
<td class="org-left"><code>[[ -f FILE ]]</code></td>
<td class="org-left">File</td>
</tr>

<tr>
<td class="org-left"><code>[[ -x FILE ]]</code></td>
<td class="org-left">Executable</td>
</tr>

<tr>
<td class="org-left"><code>[[ FILE1 -nt FILE2 ]]</code></td>
<td class="org-left">1 is more recent than 2</td>
</tr>

<tr>
<td class="org-left"><code>[[ FILE1 -ot FILE2 ]]</code></td>
<td class="org-left">2 is more recent than 1</td>
</tr>

<tr>
<td class="org-left"><code>[[ FILE1 -ef FILE2 ]]</code></td>
<td class="org-left">Same files</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-example-1" class="outline-3">
<h3 id="example-1">Example</h3>
<div class="outline-text-3" id="text-example-1">
<div class="org-src-container">
<pre class="src src-language-bash"># String
if [[ -z "$string" ]]; then
  echo "String is empty"
elif [[ -n "$string" ]]; then
  echo "String is not empty"
else
  echo "This never happens"
fi
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash"># Combinations
if [[ X &amp;&amp; Y ]]; then
  ...
fi
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash"># Equal
if [[ "$A" == "$B" ]]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash"># Regex
if [[ "A" =~ . ]]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">if (( $a &lt; $b )); then
   echo "$a is smaller than $b"
fi
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">if [[ -e "file.txt" ]]; then
  echo "file exists"
fi
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-arrays" class="outline-2">
<h2 id="arrays">Arrays</h2>
<div class="outline-text-2" id="text-arrays">
</div>
<div id="outline-container-defining-arrays" class="outline-3">
<h3 id="defining-arrays">Defining arrays</h3>
<div class="outline-text-3" id="text-defining-arrays">
<div class="org-src-container">
<pre class="src src-language-bash">Fruits=('Apple' 'Banana' 'Orange')
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">Fruits[0]="Apple"
Fruits[1]="Banana"
Fruits[2]="Orange"
</pre>
</div>
</div>
</div>
<div id="outline-container-working-with-arrays" class="outline-3">
<h3 id="working-with-arrays">Working with arrays</h3>
<div class="outline-text-3" id="text-working-with-arrays">
<div class="org-src-container">
<pre class="src src-language-bash">echo "${Fruits[0]}"           # Element #0
echo "${Fruits[-1]}"          # Last element
echo "${Fruits[@]}"           # All elements, space-separated
echo "${#Fruits[@]}"          # Number of elements
echo "${#Fruits}"             # String length of the 1st element
echo "${#Fruits[3]}"          # String length of the Nth element
echo "${Fruits[@]:3:2}"       # Range (from position 3, length 2)
echo "${!Fruits[@]}"          # Keys of all elements, space-separated
</pre>
</div>
</div>
</div>
<div id="outline-container-operations" class="outline-3">
<h3 id="operations">Operations</h3>
<div class="outline-text-3" id="text-operations">
<div class="org-src-container">
<pre class="src src-language-bash">Fruits=("${Fruits[@]}" "Watermelon")    # Push
Fruits+=('Watermelon')                  # Also Push
Fruits=( "${Fruits[@]/Ap*/}" )          # Remove by regex match
unset Fruits[2]                         # Remove one item
Fruits=("${Fruits[@]}")                 # Duplicate
Fruits=("${Fruits[@]}" "${Veggies[@]}") # Concatenate
words=($(&lt; datafile))                   # From file (split by IFS)
</pre>
</div>
</div>
</div>
<div id="outline-container-iteration" class="outline-3">
<h3 id="iteration">Iteration</h3>
<div class="outline-text-3" id="text-iteration">
<div class="org-src-container">
<pre class="src src-language-bash">for i in "${arrayName[@]}"; do
  echo "$i"
done
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-dictionaries" class="outline-2">
<h2 id="dictionaries">Dictionaries</h2>
<div class="outline-text-2" id="text-dictionaries">
</div>
<div id="outline-container-defining" class="outline-3">
<h3 id="defining">Defining</h3>
<div class="outline-text-3" id="text-defining">
<div class="org-src-container">
<pre class="src src-language-bash">declare -A sounds
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">sounds[dog]="bark"
sounds[cow]="moo"
sounds[bird]="tweet"
sounds[wolf]="howl"
</pre>
</div>

<p>
Declares <code>sound</code> as a Dictionary object (aka associative array).
</p>
</div>
</div>
<div id="outline-container-working-with-dictionaries" class="outline-3">
<h3 id="working-with-dictionaries">Working with dictionaries</h3>
<div class="outline-text-3" id="text-working-with-dictionaries">
<div class="org-src-container">
<pre class="src src-language-bash">echo "${sounds[dog]}" # Dog's sound
echo "${sounds[@]}"   # All values
echo "${!sounds[@]}"  # All keys
echo "${#sounds[@]}"  # Number of elements
unset sounds[dog]     # Delete dog
</pre>
</div>
</div>
</div>
<div id="outline-container-iteration-1" class="outline-3">
<h3 id="iteration-1">Iteration</h3>
<div class="outline-text-3" id="text-iteration-1">
</div>
<div id="outline-container-iterate-over-values" class="outline-4">
<h4 id="iterate-over-values">Iterate over values</h4>
<div class="outline-text-4" id="text-iterate-over-values">
<div class="org-src-container">
<pre class="src src-language-bash">for val in "${sounds[@]}"; do
  echo "$val"
done
</pre>
</div>
</div>
</div>
<div id="outline-container-iterate-over-keys" class="outline-4">
<h4 id="iterate-over-keys">Iterate over keys</h4>
<div class="outline-text-4" id="text-iterate-over-keys">
<div class="org-src-container">
<pre class="src src-language-bash">for key in "${!sounds[@]}"; do
  echo "$key"
done
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-options" class="outline-2">
<h2 id="options">Options</h2>
<div class="outline-text-2" id="text-options">
</div>
<div id="outline-container-options-1" class="outline-3">
<h3 id="options-1">Options</h3>
<div class="outline-text-3" id="text-options-1">
<div class="org-src-container">
<pre class="src src-language-bash">set -o noclobber  # Avoid overlay files (echo "hi" &gt; foo)
set -o errexit    # Used to exit upon error, avoiding cascading errors
set -o pipefail   # Unveils hidden failures
set -o nounset    # Exposes unset variables
</pre>
</div>
</div>
</div>
<div id="outline-container-glob-options" class="outline-3">
<h3 id="glob-options">Glob options</h3>
<div class="outline-text-3" id="text-glob-options">
<div class="org-src-container">
<pre class="src src-language-bash">shopt -s nullglob    # Non-matching globs are removed  ('*.foo' =&gt; '')
shopt -s failglob    # Non-matching globs throw errors
shopt -s nocaseglob  # Case insensitive globs
shopt -s dotglob     # Wildcards match dotfiles ("*.sh" =&gt; ".foo.sh")
shopt -s globstar    # Allow ** for recursive matches ('lib/**/*.rb' =&gt; 'lib/a/b/c.rb')
</pre>
</div>

<p>
Set <code>GLOBIGNORE</code> as a colon-separated list of patterns to be removed
from glob matches.
</p>
</div>
</div>
</div>
<div id="outline-container-history" class="outline-2">
<h2 id="history">History</h2>
<div class="outline-text-2" id="text-history">
</div>
<div id="outline-container-commands" class="outline-3">
<h3 id="commands">Commands</h3>
<div class="outline-text-3" id="text-commands">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>history</code></td>
<td class="org-left">Show history</td>
</tr>

<tr>
<td class="org-left"><code>shopt -s histverify</code></td>
<td class="org-left">Don't execute expanded result immediately</td>
</tr>
</tbody>
</table>
</div>
</div>
