references/bash-scripting-cheatsheet.org
** Expansions
:PROPERTIES:
:CUSTOM_ID: expansions
:END:

| Expression   | Description                                          |
|--------------+------------------------------------------------------|
| =!$=         | Expand last parameter of most recent command         |
| =!*=         | Expand all parameters of most recent command         |
| =!-n=        | Expand =n=th most recent command                     |
| =!n=         | Expand =n=th command in history                      |
| =!<command>= | Expand most recent invocation of command =<command>= |

** Operations
:PROPERTIES:
:CUSTOM_ID: operations-1
:END:

| Code                 | Description                                                           |
|----------------------+-----------------------------------------------------------------------|
| =!!=                 | Execute last command again                                            |
| =!!:s/<FROM>/<TO>/=  | Replace first occurrence of =<FROM>= to =<TO>= in most recent command |
| =!!:gs/<FROM>/<TO>/= | Replace all occurrences of =<FROM>= to =<TO>= in most recent command  |
| =!$:t=               | Expand only basename from last parameter of most recent command       |
| =!$:h=               | Expand only directory from last parameter of most recent command      |

=!!= and =!$= can be replaced with any valid expansion.

** Slices
:PROPERTIES:
:CUSTOM_ID: slices
:END:

| Code     | Description                                                                              |
|----------+------------------------------------------------------------------------------------------|
| =!!:n=   | Expand only =n=th token from most recent command (command is =0=; first argument is =1=) |
| =!^=     | Expand first argument from most recent command                                           |
| =!$=     | Expand last token from most recent command                                               |
| =!!:n-m= | Expand range of tokens from most recent command                                          |
| =!!:n-$= | Expand =n=th token to last from most recent command                                      |

=!!= can be replaced with any valid expansion i.e. =!cat=, =!-2=, =!42=,
etc.

* Miscellaneous
:PROPERTIES:
:CUSTOM_ID: miscellaneous
:END:

** Numeric calculations
:PROPERTIES:
:CUSTOM_ID: numeric-calculations
:END:

#+begin_src language-bash
$((a + 200))      # Add 200 to $a
#+end_src

#+begin_src language-bash
$(($RANDOM%200))  # Random number 0..199
#+end_src

#+begin_src language-bash
declare -i count  # Declare as type integer
count+=1          # Increment
#+end_src

** Subshells
:PROPERTIES:
:CUSTOM_ID: subshells
:END:

#+begin_src language-bash
(cd somedir; echo "I'm now in $PWD")
pwd # still in first directory
#+end_src

** Redirection
:PROPERTIES:
:CUSTOM_ID: redirection
:END:

#+begin_src language-bash
python hello.py > output.txt            # stdout to (file)
python hello.py >> output.txt           # stdout to (file), append
python hello.py 2> error.log            # stderr to (file)
python hello.py 2>&1                    # stderr to stdout
python hello.py 2>/dev/null             # stderr to (null)
python hello.py >output.txt 2>&1        # stdout and stderr to (file), equivalent to &>
python hello.py &>/dev/null             # stdout and stderr to (null)
echo "$0: warning: too many users" >&2  # print diagnostic message to stderr
#+end_src

#+begin_src language-bash
python hello.py < foo.txt      # feed foo.txt to stdin for python
diff <(ls -r) <(ls)            # Compare two stdout without files
#+end_src

** Inspecting commands
:PROPERTIES:
:CUSTOM_ID: inspecting-commands
:END:

#+begin_src language-bash
command -V cd
#=> "cd is a function/alias/whatever"
#+end_src

** Trap errors
:PROPERTIES:
:CUSTOM_ID: trap-errors
:END:

#+begin_src language-bash
trap 'echo Error at about $LINENO' ERR
#+end_src

or

#+begin_src language-bash
traperr() {
  echo "ERROR: ${BASH_SOURCE[1]} at about ${BASH_LINENO[0]}"
}

set -o errtrace
trap traperr ERR
#+end_src

** Case/switch
:PROPERTIES:
:CUSTOM_ID: caseswitch
:END:

#+begin_src language-bash
case "$1" in
  start | up)
    vagrant up
    ;;

  ,*)
    echo "Usage: $0 {start|stop|ssh}"
    ;;
esac
#+end_src

** Source relative
:PROPERTIES:
:CUSTOM_ID: source-relative
:END:

#+begin_src language-bash
source "${0%/*}/../share/foo.sh"
#+end_src

** printf
:PROPERTIES:
:CUSTOM_ID: printf
:END:

#+begin_src language-bash
printf "Hello %s, I'm %s" Sven Olga
#=> "Hello Sven, I'm Olga

printf "1 + 1 = %d" 2
#=> "1 + 1 = 2"

printf "This is how you print a float: %f" 2
#=> "This is how you print a float: 2.000000"

printf '%s\n' '#!/bin/bash' 'echo hello' >file
# format string is applied to each group of arguments
printf '%i+%i=%i\n' 1 2 3  4 5 9
#+end_src

** Transform strings
:PROPERTIES:
:CUSTOM_ID: transform-strings
:END:

| Command option | Description                                         |
|----------------+-----------------------------------------------------|
| =-c=           | Operations apply to characters not in the given set |
| =-d=           | Delete characters                                   |
| =-s=           | Replaces repeated characters with single occurrence |
| =-t=           | Truncates                                           |
| =[:upper:]=    | All upper case letters                              |
| =[:lower:]=    | All lower case letters                              |
| =[:digit:]=    | All digits                                          |
| =[:space:]=    | All whitespace                                      |
| =[:alpha:]=    | All letters                                         |
| =[:alnum:]=    | All letters and digits                              |

*** Example
:PROPERTIES:
:CUSTOM_ID: example-2
:END:
#+begin_src language-bash
echo "Welcome To Devhints" | tr '[:lower:]' '[:upper:]'
WELCOME TO DEVHINTS
#+end_src

