docs/references/bash-scripting-cheatsheet.html
<div id="outline-container-expansions" class="outline-3">
<h3 id="expansions">Expansions</h3>
<div class="outline-text-3" id="text-expansions">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>!$</code></td>
<td class="org-left">Expand last parameter of most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!*</code></td>
<td class="org-left">Expand all parameters of most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!-n</code></td>
<td class="org-left">Expand =n=th most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!n</code></td>
<td class="org-left">Expand =n=th command in history</td>
</tr>

<tr>
<td class="org-left"><code>!&lt;command&gt;</code></td>
<td class="org-left">Expand most recent invocation of command <code>&lt;command&gt;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-operations-1" class="outline-3">
<h3 id="operations-1">Operations</h3>
<div class="outline-text-3" id="text-operations-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>!!</code></td>
<td class="org-left">Execute last command again</td>
</tr>

<tr>
<td class="org-left"><code>!!:s/&lt;FROM&gt;/&lt;TO&gt;/</code></td>
<td class="org-left">Replace first occurrence of <code>&lt;FROM&gt;</code> to <code>&lt;TO&gt;</code> in most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!!:gs/&lt;FROM&gt;/&lt;TO&gt;/</code></td>
<td class="org-left">Replace all occurrences of <code>&lt;FROM&gt;</code> to <code>&lt;TO&gt;</code> in most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!$:t</code></td>
<td class="org-left">Expand only basename from last parameter of most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!$:h</code></td>
<td class="org-left">Expand only directory from last parameter of most recent command</td>
</tr>
</tbody>
</table>

<p>
<code>!!</code> and <code>!$</code> can be replaced with any valid expansion.
</p>
</div>
</div>
<div id="outline-container-slices" class="outline-3">
<h3 id="slices">Slices</h3>
<div class="outline-text-3" id="text-slices">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>!!:n</code></td>
<td class="org-left">Expand only <code>n=th token from most recent command (command is =0</code>; first argument is <code>1</code>)</td>
</tr>

<tr>
<td class="org-left"><code>!^</code></td>
<td class="org-left">Expand first argument from most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!$</code></td>
<td class="org-left">Expand last token from most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!!:n-m</code></td>
<td class="org-left">Expand range of tokens from most recent command</td>
</tr>

<tr>
<td class="org-left"><code>!!:n-$</code></td>
<td class="org-left">Expand =n=th token to last from most recent command</td>
</tr>
</tbody>
</table>

<p>
<code>!!</code> can be replaced with any valid expansion i.e. <code>!cat</code>, <code>!-2</code>, <code>!42</code>,
etc.
</p>
</div>
</div>
</div>
<div id="outline-container-miscellaneous" class="outline-2">
<h2 id="miscellaneous">Miscellaneous</h2>
<div class="outline-text-2" id="text-miscellaneous">
</div>
<div id="outline-container-numeric-calculations" class="outline-3">
<h3 id="numeric-calculations">Numeric calculations</h3>
<div class="outline-text-3" id="text-numeric-calculations">
<div class="org-src-container">
<pre class="src src-language-bash">$((a + 200))      # Add 200 to $a
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">$(($RANDOM%200))  # Random number 0..199
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">declare -i count  # Declare as type integer
count+=1          # Increment
</pre>
</div>
</div>
</div>
<div id="outline-container-subshells" class="outline-3">
<h3 id="subshells">Subshells</h3>
<div class="outline-text-3" id="text-subshells">
<div class="org-src-container">
<pre class="src src-language-bash">(cd somedir; echo "I'm now in $PWD")
pwd # still in first directory
</pre>
</div>
</div>
</div>
<div id="outline-container-redirection" class="outline-3">
<h3 id="redirection">Redirection</h3>
<div class="outline-text-3" id="text-redirection">
<div class="org-src-container">
<pre class="src src-language-bash">python hello.py &gt; output.txt            # stdout to (file)
python hello.py &gt;&gt; output.txt           # stdout to (file), append
python hello.py 2&gt; error.log            # stderr to (file)
python hello.py 2&gt;&amp;1                    # stderr to stdout
python hello.py 2&gt;/dev/null             # stderr to (null)
python hello.py &gt;output.txt 2&gt;&amp;1        # stdout and stderr to (file), equivalent to &amp;&gt;
python hello.py &amp;&gt;/dev/null             # stdout and stderr to (null)
echo "$0: warning: too many users" &gt;&amp;2  # print diagnostic message to stderr
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language-bash">python hello.py &lt; foo.txt      # feed foo.txt to stdin for python
diff &lt;(ls -r) &lt;(ls)            # Compare two stdout without files
</pre>
</div>
</div>
</div>
<div id="outline-container-inspecting-commands" class="outline-3">
<h3 id="inspecting-commands">Inspecting commands</h3>
<div class="outline-text-3" id="text-inspecting-commands">
<div class="org-src-container">
<pre class="src src-language-bash">command -V cd
#=&gt; "cd is a function/alias/whatever"
</pre>
</div>
</div>
</div>
<div id="outline-container-trap-errors" class="outline-3">
<h3 id="trap-errors">Trap errors</h3>
<div class="outline-text-3" id="text-trap-errors">
<div class="org-src-container">
<pre class="src src-language-bash">trap 'echo Error at about $LINENO' ERR
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-language-bash">traperr() {
  echo "ERROR: ${BASH_SOURCE[1]} at about ${BASH_LINENO[0]}"
}

set -o errtrace
trap traperr ERR
</pre>
</div>
</div>
</div>
<div id="outline-container-caseswitch" class="outline-3">
<h3 id="caseswitch">Case/switch</h3>
<div class="outline-text-3" id="text-caseswitch">
<div class="org-src-container">
<pre class="src src-language-bash">case "$1" in
  start | up)
    vagrant up
    ;;

  *)
    echo "Usage: $0 {start|stop|ssh}"
    ;;
esac
</pre>
</div>
</div>
</div>
<div id="outline-container-source-relative" class="outline-3">
<h3 id="source-relative">Source relative</h3>
<div class="outline-text-3" id="text-source-relative">
<div class="org-src-container">
<pre class="src src-language-bash">source "${0%/*}/../share/foo.sh"
</pre>
</div>
</div>
</div>
<div id="outline-container-printf" class="outline-3">
<h3 id="printf">printf</h3>
<div class="outline-text-3" id="text-printf">
<div class="org-src-container">
<pre class="src src-language-bash">printf "Hello %s, I'm %s" Sven Olga
#=&gt; "Hello Sven, I'm Olga

printf "1 + 1 = %d" 2
#=&gt; "1 + 1 = 2"

printf "This is how you print a float: %f" 2
#=&gt; "This is how you print a float: 2.000000"

printf '%s\n' '#!/bin/bash' 'echo hello' &gt;file
# format string is applied to each group of arguments
printf '%i+%i=%i\n' 1 2 3  4 5 9
</pre>
</div>
</div>
</div>
<div id="outline-container-transform-strings" class="outline-3">
<h3 id="transform-strings">Transform strings</h3>
<div class="outline-text-3" id="text-transform-strings">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command option</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-c</code></td>
<td class="org-left">Operations apply to characters not in the given set</td>
</tr>

<tr>
<td class="org-left"><code>-d</code></td>
<td class="org-left">Delete characters</td>
</tr>

<tr>
<td class="org-left"><code>-s</code></td>
<td class="org-left">Replaces repeated characters with single occurrence</td>
</tr>

<tr>
<td class="org-left"><code>-t</code></td>
<td class="org-left">Truncates</td>
</tr>

<tr>
<td class="org-left"><code>[:upper:]</code></td>
<td class="org-left">All upper case letters</td>
</tr>

<tr>
<td class="org-left"><code>[:lower:]</code></td>
<td class="org-left">All lower case letters</td>
</tr>

<tr>
<td class="org-left"><code>[:digit:]</code></td>
<td class="org-left">All digits</td>
</tr>

<tr>
<td class="org-left"><code>[:space:]</code></td>
<td class="org-left">All whitespace</td>
</tr>

<tr>
<td class="org-left"><code>[:alpha:]</code></td>
<td class="org-left">All letters</td>
</tr>

<tr>
<td class="org-left"><code>[:alnum:]</code></td>
<td class="org-left">All letters and digits</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-example-2" class="outline-4">
<h4 id="example-2">Example</h4>
<div class="outline-text-4" id="text-example-2">
<div class="org-src-container">
<pre class="src src-language-bash">echo "Welcome To Devhints" | tr '[:lower:]' '[:upper:]'
WELCOME TO DEVHINTS
</pre>
</div>
</div>
</div>
</div>
