references/bash-scripting-cheatsheet.org
** Directory of script
:PROPERTIES:
:CUSTOM_ID: directory-of-script
:END:

#+begin_src language-bash
dir=${0%/*}
#+end_src

** Getting options
:PROPERTIES:
:CUSTOM_ID: getting-options
:END:

#+begin_src language-bash
while [[ "$1" =~ ^- && ! "$1" == "--" ]]; do case $1 in
  -V | --version )
    echo "$version"
    exit
    ;;
  -s | --string )
    shift; string=$1
    ;;
  -f | --flag )
    flag=1
    ;;
esac; shift; done
if [[ "$1" == '--' ]]; then shift; fi
#+end_src

** Heredoc
:PROPERTIES:
:CUSTOM_ID: heredoc
:END:

#+begin_src language-sh
cat <<END
hello world
END
#+end_src

Heredoc allows a section of your source code to be treated as a file.
See
[[https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Documents][Bash Reference Manual]].

** Herestring
:PROPERTIES:
:CUSTOM_ID: herestring
:END:

#+begin_src language-sh
tr '[:lower:]' '[:upper:]' <<< "Will be uppercased, even $variable"
#+end_src

Herestring allows a string to be treated as a standard input (stdin).
See
[[https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Strings][Bash Reference Manual]].

** Process substitution
:PROPERTIES:
:CUSTOM_ID: process-substitution
:END:

#+begin_src language-sh
# loop on myfunc output lines
while read -r line; do
  echo "$line"
done < <(myfunc)

# compare content of two folders
diff <(ls "$dir1") <(ls "$dir2")
#+end_src

Process substitution allows the input (or output) of a command to be
treated as a file. See
[[https://www.gnu.org/software/bash/manual/html_node/Process-Substitution.html][Bash Reference Manual]].

** Reading input
:PROPERTIES:
:CUSTOM_ID: reading-input
:END:

#+begin_src language-bash
echo -n "Proceed? [y/n]: "
read -r ans
echo "$ans"
#+end_src

The =-r= option disables a peculiar legacy behavior with backslashes.

#+begin_src language-bash
read -n 1 ans    # Just one character
#+end_src

** Special variables
:PROPERTIES:
:CUSTOM_ID: special-variables
:END:

| Expression         | Description                            |
|--------------------+----------------------------------------|
| =$?=               | Exit status of last task               |
| =$!=               | PID of last background task            |
| =$$=               | PID of shell                           |
| =$0=               | Filename of the shell script           |
| =$_=               | Last argument of the previous command  |
| =${PIPESTATUS[n]}= | return value of piped commands (array) |

See
[[https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars#special_parameters_and_shell_variables][Special parameters]].

** Go to previous directory
:PROPERTIES:
:CUSTOM_ID: go-to-previous-directory
:END:

#+begin_src language-bash
pwd # /home/user/foo
cd bar/
pwd # /home/user/foo/bar
cd -
pwd # /home/user/foo
#+end_src

** Check for command's result
:PROPERTIES:
:CUSTOM_ID: check-for-commands-result
:END:

#+begin_src language-bash
if ping -c 1 google.com; then
  echo "It appears you have a working internet connection"
fi
#+end_src

** Grep check
:PROPERTIES:
:CUSTOM_ID: grep-check
:END:

#+begin_src language-bash
if grep -q 'foo' ~/.bash_history; then
  echo "You appear to have typed 'foo' in the past"
fi
#+end_src

* Also see
:PROPERTIES:
:CUSTOM_ID: also-see
:END:

- [[https://web.archive.org/web/20230406205817/https://wiki.bash-hackers.org/][Bash-hackers wiki]]
  /(bash-hackers.org)/
- [[https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars][Shell vars]]
  /(bash-hackers.org)/
- [[https://learnxinyminutes.com/docs/bash/][Learn bash in y minutes]]
  /(learnxinyminutes.com)/
- [[http://mywiki.wooledge.org/BashGuide][Bash Guide]]
  /(mywiki.wooledge.org)/
- [[https://www.shellcheck.net/][ShellCheck]] /(shellcheck.net)/
