docs/references/bash-scripting-cheatsheet.html
<div id="outline-container-directory-of-script" class="outline-3">
<h3 id="directory-of-script">Directory of script</h3>
<div class="outline-text-3" id="text-directory-of-script">
<div class="org-src-container">
<pre class="src src-language-bash">dir=${0%/*}
</pre>
</div>
</div>
</div>
<div id="outline-container-getting-options" class="outline-3">
<h3 id="getting-options">Getting options</h3>
<div class="outline-text-3" id="text-getting-options">
<div class="org-src-container">
<pre class="src src-language-bash">while [[ "$1" =~ ^- &amp;&amp; ! "$1" == "--" ]]; do case $1 in
  -V | --version )
    echo "$version"
    exit
    ;;
  -s | --string )
    shift; string=$1
    ;;
  -f | --flag )
    flag=1
    ;;
esac; shift; done
if [[ "$1" == '--' ]]; then shift; fi
</pre>
</div>
</div>
</div>
<div id="outline-container-heredoc" class="outline-3">
<h3 id="heredoc">Heredoc</h3>
<div class="outline-text-3" id="text-heredoc">
<div class="org-src-container">
<pre class="src src-language-sh">cat &lt;&lt;END
hello world
END
</pre>
</div>

<p>
Heredoc allows a section of your source code to be treated as a file.
See
<a href="https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Documents">Bash Reference Manual</a>.
</p>
</div>
</div>
<div id="outline-container-herestring" class="outline-3">
<h3 id="herestring">Herestring</h3>
<div class="outline-text-3" id="text-herestring">
<div class="org-src-container">
<pre class="src src-language-sh">tr '[:lower:]' '[:upper:]' &lt;&lt;&lt; "Will be uppercased, even $variable"
</pre>
</div>

<p>
Herestring allows a string to be treated as a standard input (stdin).
See
<a href="https://www.gnu.org/software/bash/manual/html_node/Redirections.html#Here-Strings">Bash Reference Manual</a>.
</p>
</div>
</div>
<div id="outline-container-process-substitution" class="outline-3">
<h3 id="process-substitution">Process substitution</h3>
<div class="outline-text-3" id="text-process-substitution">
<div class="org-src-container">
<pre class="src src-language-sh"># loop on myfunc output lines
while read -r line; do
  echo "$line"
done &lt; &lt;(myfunc)

# compare content of two folders
diff &lt;(ls "$dir1") &lt;(ls "$dir2")
</pre>
</div>

<p>
Process substitution allows the input (or output) of a command to be
treated as a file. See
<a href="https://www.gnu.org/software/bash/manual/html_node/Process-Substitution.html">Bash Reference Manual</a>.
</p>
</div>
</div>
<div id="outline-container-reading-input" class="outline-3">
<h3 id="reading-input">Reading input</h3>
<div class="outline-text-3" id="text-reading-input">
<div class="org-src-container">
<pre class="src src-language-bash">echo -n "Proceed? [y/n]: "
read -r ans
echo "$ans"
</pre>
</div>

<p>
The <code>-r</code> option disables a peculiar legacy behavior with backslashes.
</p>

<div class="org-src-container">
<pre class="src src-language-bash">read -n 1 ans    # Just one character
</pre>
</div>
</div>
</div>
<div id="outline-container-special-variables" class="outline-3">
<h3 id="special-variables">Special variables</h3>
<div class="outline-text-3" id="text-special-variables">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>$?</code></td>
<td class="org-left">Exit status of last task</td>
</tr>

<tr>
<td class="org-left"><code>$!</code></td>
<td class="org-left">PID of last background task</td>
</tr>

<tr>
<td class="org-left"><code>$$</code></td>
<td class="org-left">PID of shell</td>
</tr>

<tr>
<td class="org-left"><code>$0</code></td>
<td class="org-left">Filename of the shell script</td>
</tr>

<tr>
<td class="org-left"><code>$_</code></td>
<td class="org-left">Last argument of the previous command</td>
</tr>

<tr>
<td class="org-left"><code>${PIPESTATUS[n]}</code></td>
<td class="org-left">return value of piped commands (array)</td>
</tr>
</tbody>
</table>

<p>
See
<a href="https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars#special_parameters_and_shell_variables">Special parameters</a>.
</p>
</div>
</div>
<div id="outline-container-go-to-previous-directory" class="outline-3">
<h3 id="go-to-previous-directory">Go to previous directory</h3>
<div class="outline-text-3" id="text-go-to-previous-directory">
<div class="org-src-container">
<pre class="src src-language-bash">pwd # /home/user/foo
cd bar/
pwd # /home/user/foo/bar
cd -
pwd # /home/user/foo
</pre>
</div>
</div>
</div>
<div id="outline-container-check-for-commands-result" class="outline-3">
<h3 id="check-for-commands-result">Check for command's result</h3>
<div class="outline-text-3" id="text-check-for-commands-result">
<div class="org-src-container">
<pre class="src src-language-bash">if ping -c 1 google.com; then
  echo "It appears you have a working internet connection"
fi
</pre>
</div>
</div>
</div>
<div id="outline-container-grep-check" class="outline-3">
<h3 id="grep-check">Grep check</h3>
<div class="outline-text-3" id="text-grep-check">
<div class="org-src-container">
<pre class="src src-language-bash">if grep -q 'foo' ~/.bash_history; then
  echo "You appear to have typed 'foo' in the past"
fi
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-also-see" class="outline-2">
<h2 id="also-see">Also see</h2>
<div class="outline-text-2" id="text-also-see">
<ul class="org-ul">
<li><a href="https://web.archive.org/web/20230406205817/https://wiki.bash-hackers.org/">Bash-hackers wiki</a>
<i>(bash-hackers.org)</i></li>
<li><a href="https://web.archive.org/web/20230318164746/https://wiki.bash-hackers.org/syntax/shellvars">Shell vars</a>
<i>(bash-hackers.org)</i></li>
<li><a href="https://learnxinyminutes.com/docs/bash/">Learn bash in y minutes</a>
<i>(learnxinyminutes.com)</i></li>
<li><a href="http://mywiki.wooledge.org/BashGuide">Bash Guide</a>
<i>(mywiki.wooledge.org)</i></li>
<li><a href="https://www.shellcheck.net/">ShellCheck</a> <i>(shellcheck.net)</i></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://devhints.io/bash">devhints.io</a></p>
<p class="date">Created: 2026-03-06 Fri 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
